src/Documents/КАЗ_ПриходныйКассовыйОрдер/КАЗ_ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ПриходныйКассовыйОрдер</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <registerRecords>AccumulationRegister.КАЗ_ОстаткиСчетовИКасс</registerRecords>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ФактическиеПлатежи/КАЗ_ФактическиеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ФактическиеПлатежи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/КАЗ_ОстаткиСчетовИКасс/КАЗ_ОстаткиСчетовИКасс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ОстаткиСчетовИКасс</name>
  <registerType>Balance</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетКасса</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КАЗ_ПриходныйКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Касса) Тогда
		Сообщить("Не выбрана касса.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма ПКО должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ФактическиеПлатежи.Записывать = Истина;
	ДвижениеПлатеж = Движения.КАЗ_ФактическиеПлатежи.Добавить();
	ДвижениеПлатеж.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПлатеж.Период = Дата;
	ДвижениеПлатеж.Контрагент = Контрагент;
	ДвижениеПлатеж.Сумма = Сумма;

	Движения.КАЗ_ОстаткиСчетовИКасс.Записывать = Истина;
	ДвижениеКасса = Движения.КАЗ_ОстаткиСчетовИКасс.Добавить();
	ДвижениеКасса.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеКасса.Период = Дата;
	ДвижениеКасса.СчетКасса = Касса;
	ДвижениеКасса.Сумма = Сумма;

КонецПроцедуры
